### Introduction to Pandas

#### Plan
- Data Frames
- Series
- Index
- Accessing Element
- Element-wise operations
- Filtering
- String Operations
- Missing Values
- Grouping
- Getting the Numpy arrays

In [1]:
import numpy as np
import pandas as pd

#### DataFrames
##### Let's create some data

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [3]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [4]:
### another way of creating dataframe
data2 = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "MSRP": 32340
    }
]

In [5]:
df2 = pd.DataFrame(data2)
df2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [6]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

#### Series

In [7]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [8]:
df['Make']

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [9]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [10]:
### accessing multiple columns
df[['Make', 'Model', 'MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [11]:
### adding new column
df['Vehicle Type'] = df['Make'] + ' ' + df['Model']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

In [12]:
df['id'] = [1, 2, 3, 4, 5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier,5

In [13]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier,5

In [14]:
del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

#### Index

In [15]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
# multiple rows
df.loc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise

In [17]:
# replacing the index
df.index = ['a', 'b', 'c', 'd', 'e']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

In [18]:
### positional index
df.iloc[[1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise

In [19]:
# reset the index
df = df.reset_index(drop=True)

In [20]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,Lotus Elise
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

#### Element-wise operations

In [21]:
(df['Engine HP'] / 100) * 2

0    2.76
1     NaN
2    4.36
3    3.88
4    5.22
Name: Engine HP, dtype: float64

In [22]:
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

#### Filtering

In [23]:
df[
  df['Year'] >= 2015
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

In [24]:
df[
  df['Make'] == 'Nissan'
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,Nissan Stanza
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

In [25]:
### combined conditions
df[
  (df['Make'] == 'Nissan') & (df['Year'] >= 2015)
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

#### String Operations

In [26]:
'STRr'.lower()

'strr'

In [27]:
df['Vehicle_Style'].str.lower()

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle_Style, dtype: object

In [28]:
df['Vehicle_Style'].str.upper()

0          SEDAN
1          SEDAN
2    CONVERTIBLE
3        4DR SUV
4         PICKUP
Name: Vehicle_Style, dtype: object

In [29]:
#.replace('what do you want to replace', 'with what')
'machine learning zoomcamp'.replace(' ', '_')

'machine_learning_zoomcamp'

In [30]:
df['Vehicle_Style'].str.replace(' ', '_')

0          sedan
1          Sedan
2    convertible
3        4dr_SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [31]:
# chaining
df['Vehicle_Style'].str.replace(' ', '_').str.lower().str.capitalize()

0          Sedan
1          Sedan
2    Convertible
3        4dr_suv
4         Pickup
Name: Vehicle_Style, dtype: object

In [32]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.replace(' ', '_').str.lower().str.capitalize()
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,Sedan,2000,Nissan Stanza
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,Convertible,54990,Lotus Elise
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

#### Summarizing operations

In [33]:
df.MSRP.min()

2000

In [34]:
df.MSRP.max()

54990

In [35]:
df.MSRP.mean()

30186.0

In [36]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [37]:
df.describe()

              Year  Engine HP  Engine Cylinders          MSRP
count     5.000000    4.00000          5.000000      5.000000
mean   2010.400000  202.75000          4.400000  30186.000000
std      11.260551   51.29896          0.894427  18985.044904
min    1991.000000  138.00000          4.000000   2000.000000
25%    2010.000000  180.00000          4.000000  27150.000000
50%    2017.000000  206.00000          4.000000  32340.000000
75%    2017.000000  228.75000          4.000000  34450.000000
max    2017.000000  261.00000          6.000000  54990.000000

In [38]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders      MSRP
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

In [39]:
df.Make.nunique()

4

In [40]:
df.nunique()

Make                 4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
MSRP                 5
Vehicle Type         5
dtype: int64

#### Missing Values

In [41]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,False,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False

In [42]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
Vehicle Type         0
dtype: int64

#### Grouping

In [48]:
df.groupby('Transmission Type').MSRP.mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

#### Getting the NumPy arrays

In [44]:
df.MSRP.values

array([ 2000, 27150, 54990, 34450, 32340])

In [45]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,Vehicle Type
0,Nissan,Stanza,1991,138.0,4,MANUAL,Sedan,2000,Nissan Stanza
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,Hyundai Sonata
2,Lotus,Elise,2010,218.0,4,MANUAL,Convertible,54990,Lotus Elise
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450,GMC Acadia
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,Nissan Frontier

In [46]:
df.to_dict(orient='records')

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Sedan',
  'MSRP': 2000,
  'Vehicle Type': 'Nissan Stanza'},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'Sedan',
  'MSRP': 27150,
  'Vehicle Type': 'Hyundai Sonata'},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Convertible',
  'MSRP': 54990,
  'Vehicle Type': 'Lotus Elise'},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr_suv',
  'MSRP': 34450,
  'Vehicle Type': 'GMC Acadia'},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Pickup',
  'MSRP': 32340,
  'Vehicle Type': 'Nissan Frontier'}]